---
kind: type
id: T:Autodesk.Revit.DB.ImportExportFileFormat
source: html/f43a36a6-ebce-29e2-693b-9b9867da026b.htm
---
# Autodesk.Revit.DB.ImportExportFileFormat

Describes formats supported by import / export.

## Syntax (C#)
```csharp
public enum ImportExportFileFormat
```